[{"id":0,"title":"","message":""},{"id":1,"title":"january prayer showers","message":"<center>\n\n            <h3> JANUARY PRAYER SHOWERS <\/h3> <!--JANUARY: WEEK 1-->\n            \n<\/center>\n<h4>  <\/h4>  <!--TITLE-->\n<P>\n1. Thank you Lord for answering my prayer and giving me victory over all my\nchallenges of last year – Ps. 118:21[NLT].  <br\/>\n2. I shall not die but live and declare the works of the lord throughout this year –\nPs.118:17. <br\/>\n3. The Lord will perfect all that concerns me this year in the name of Jesus\nChrist – Ps. 138:8a. <br\/>\n4. The sun shall not smite me by day or the moon by night in Jesus\\' name – Ps. 121:6. <br\/>\n5. The Lord will guide me along unfamiliar paths and turn darkness into light\nbefore me – Isaiah 42:16b. <br\/>\n6. This year, the Lord shall exalt my horn, like the horn of the unicorn; I shall be\nanointed with fresh oil – Ps. 92:10. <br\/>\n7. The Lord will guide me along unfamiliar paths and turn darkness into light\nbefore me – Ps. 18:28b. <br\/>\n8. This year 2019, every valley of my life shall be exalted, every mountain and hill shall be made low, and the crooked paths shall be made straight and the rough places shall be made plain – Isaiah 40:4. <br\/>\n9. This year, I receive the spirit of wisdom and understanding, the spirit of\ncounsel and might in the name of Jesus – Isaiah 11:2. <br\/>\n10. All those who hate me shall be clothed with shame – Job 8:22a. <br\/>\n11. This year, when men say there is a casting down, then I shall say, there is a lifting up – Job 22:29a. <br\/>\n12. This year, when the enemy shall come in like flood, the Spirit of the Lord\nshall lift up a standard against him - Isaiah 59:19b. <br\/>\n13. The Lord will cause a new thing to spring forth in all areas of my life in Jesus\\'\nname – Isaiah 43:19a. <br\/>\n14. This year, I shall possess all my possessions in Jesus\\' name – Obadiah 17. <br\/>\n15. This year, the Lord will restore to me the years that the locust and caterpillar\nhave eaten in the name of Jesus – Joel 2:25. <br\/>\n16. I shall eat in plenty and be satisfied this year in Jesus\\' name – Joel 2:26a. <br\/>\n17. The Lord shall be with me this year, therefore, everything I do shall prosper in\nJesus\\' name – Gen. 39:23. <br\/>\n18. Each day of this year, the Lord shall bare me on eagle\\'s wings in Jesus\\' name –\nEx. 19:4b. <br\/>\n19. The angel of the living God shall go before me this year and make my journey\nprosperous in Jesus\\' name – Ex. 23:23a. <br\/>\n20. This year, the Lord shall bless my bread and water in Jesus\\' name – Ex. 23:25a. <br\/>\n21. This year, the Lord will take away sickness from me and from my family in\nthe name of Jesus – Ex. 23:25b. <br\/>\n22. The presence of God shall go before me this year and He will give me rest – Ex.\n33:14.<br\/>\n23. Lord, let the light of your face shine upon me throughout this year in the name\nof Jesus – Ps 4:6b. <br\/>\n24. I refuse to follow the Lord at a distance this year in the name of Jesus, I will\nfollow Him closely and intimately – Matthew 26:58a. <br\/>\n25. The wind of this year shall not blow contrary to God\\'s will in my life in Jesus\\'\nname – Matthew 14:24b. <br\/>\n26. This year, the Lord shall increase my greatness in Jesus\\' name – Ps 11:21a. <br\/>\n27. Every place I set my foot this year, the Lord will give unto me in the name of\nJesus – Joshua 1:3. <br\/>\n28. No one will be able to stand up against me in the name of Jesus – Joshua 1:5a. <br\/>\n29. God shall bring all the counsel of my adversaries to nought in the name of\nJesus – Nehemiah 4:15b. <br\/>\n30. My sun shall not go down; neither shall my moon withdraw itself in Jesus\\'\nname – Isaiah 60:20a. <br\/>\n31. Commit your projects\/plans\/desires to the Lord.\n<\/P>\n\n<h4>PRAYERS FOR NBC PUBLICATIONS <\/h4>\n<p>\n\n1. Give thanks to the Lord for the works of Publications ministries of NBC. <br\/>\n2. O Lord, may the Publications ministries of NBC circulate what will bring\nencouragement and hope to people. <br\/>\n3. O Lord, give enablement to publish messages that will touch readers\\' hearts\nand bring positive changes. <br\/>\n4. O Lord, let what is published be a guide that will enable people to interface\nwith the written Scriptures in a life-changing way. <br\/>\n5. O Lord, may Publications ministries of NBC grow from glory to glory; from\nsuccess to success. <br\/>\n6. O Lord, the Publications ministries will not be publishers without a message. <br\/>\n7. O Lord, let all the media of NBC Publications be effectively utilised for the\nexpansion of Your kingdom. <br\/>\n8. O Lord, may the staff of NBC Publications ministries never lack wisdom and\nknowledge to do their work. <br\/>\n9. O Lord, may all NBC Literature continue to make right impact in the lives of\nthe users. <br\/>\n10. O Lord, continuously raise up the head of NBC Publications ministries. <br\/>\n11. O Lord, NBC Publications ministries will never lack inspiration. <br\/>\n12. O Lord, the efforts of Publications ministries to make people hear and receive\nthe Gospel will not be wasted in Jesus\\' name. <br\/>\n13. O Lord, may the sphere of coverage of Publications ministries to raise mature\nbelievers in Christ through literature increase. <br\/>\n14. O Lord, may the goal of establishing Publications ministries be fulfilled. <br\/>\n15. O Lord, let our devotionals inspire people to learn, believe, pray, and live the Word\nof God, by the power of God\\'s Spirit, for the glory of God\\'s Son, Jesus.\n\n<\/p>"},{"id":2,"title":"february prayer showers","message":"<\/center>\n<h4> Prayer for Nigeria and 2019 Elections <\/h4>  <!--TITLE-->\n<P>\nLord, we thank you for your eternal love for Nigeria. We highly exalt you in Nigeria above all gods (Romans 8:35-39). <br\/>\n\n1. Our gracious God, we gaze at you concerning the elections, deliver us from all forms of mockery, ridicule, reproach and shame in the name of Jesus (Psalm 34:5).<br\/>\n2. Father, elect for us wise and godly leaders who will lead the nation to the Promised Land (Psalm 47:2-4). <br\/>\n3. God, by your mercy, cause positive change in our nation (Luke 17:13).<br\/>\n4. Lord, answer us as we call upon you. By your mercy, manifest your power\nover Nigeria (Exodus 9:16).<br\/>\n5. Jehovah Shalom, satisfy us with your peace and goodness in Nigeria\n(Jeremiah 31:14). <br\/>\n6. Father, cause us to live in prosperity and abundance in our land just as you\npromised (John 10:10). <br\/>\n7. Lord, intervene in the plans and decisions of the Independent National Electoral Commission (INEC) during and after the elections in Jesus\\' name (Proverbs 21:31; Psalm 109:26-27). <br\/>\n8. I terminate in the name of Jesus whatever is not part of God\\'s agenda for Nigeria in this\nelection and everyday of our lives as a nation (Lamentations 3:37). <br\/>\n9. Father, every negative pronouncement against the advancement of Nigeria is\nannulled in Jesus\\' name (Isaiah 54:17). <br\/>\n10. Father, terrify and remove every power, person, project, programme whose presence provokes stagnation, intimidation, frustration and persecution in Nigeria (Isaiah 59:19). <br\/>\n11. Lord, bring us out of the horrible pit and make us secure in our land (Psalm 40:2). <br\/>\n12. Father, release strength, courage and boldness to Christians so as to occupy our\nappropriate positions and so that we can enter into our Rehoboth (Genesis 26:22). <br\/>\n13. Lord, set divine mandate and machinery in motion to establish your rule and reign\nover Nigeria and to make it a place of praise for your name (Isaiah 62:6-7). <br\/>\n14. Lord, let the election results and outcomes in Nigeria bring liberation, joy,\ncelebration and jubilation in the name of Jesus (Psalm 51:8). <br\/>\n15. Lord, let faithful workers enjoy the works of their hands. Let us not labour in\nvain in Jesus\\' name (Isaiah 65:21-23). <br\/>\n16. Father, let us experience your mercies daily. Let your mercy preserve us from\nbeing consumed (Lamentation 3:22-23). <br\/>\n17. Jehovah Shalom, our Prince of Peace, grant Nigeria peace that surpasses all\npersons\\' understanding in the name of Jesus (Leviticus 26:6). <br\/>\n18. Lord, every unfulfilled praiseworthy prophecies concerning Nigeria shall be\nfulfilled this year in Jesus\\' name (Isaiah 55:11).<br\/>\n19. Father, wipe away our tears. The time to favour us is now. Let our time of\nrejoicing come (Psalm 102:13; Isaiah 126:5). <br\/>\n20. Lord, be gracious unto us in Nigeria. Remember the elect who are interceding and\ngroaning concerning Nigeria. Have compassion upon us (2 Kings 13:23). <br\/>\n21. I decree that God who has the key and authority over principalities and powers will provide Nigeria a thorough, fair and hitch free election in the name of Jesus (Numbers 14:28). <br\/>\n22. Lord Jesus, let the abundant life that you bought with your blood preserve and\nprotect us from every form of calamity and captivity (John 10:10). <br\/>\n23. I decree and declare that all dead bones in terms of goodness, prosperity, good health,\neducation and infrastructure shall receive new life in Jesus\\' name (Ezekiel 37:5). <br\/>\n24. I decree that Nigeria should begin to live triumphantly in Jesus\\' name (Romans\n8:37). <br\/>\n25. Lord, redeem and adopt our leaders as your children to fear and obey you so that Nigeria\nwill be a land of great beauty where peace and justice reign (John 1:12). <br\/>\n26. I declare deliverance from every form of captivity for all Nigerians and power to\npossess our possessions in the mighty name of Jesus (Obadiah 1:17). <br\/>\n27. Father, arise and scatter your enemies in this nation. Let your kingdom come\n(Matthew 6:10). <br\/>\n28. As an oracle of God, I prophesy the immediate manifestation of every\npromise of God concerning Nigeria in Jesus\\' name (Luke 24:40). <br\/>\n29. Father Lord, cause your light which darkness cannot comprehend to shine\nthrough this nation and the election processes (John 1:5). <br\/>\n30. Lord, let our votes fall on fertile grounds. Do not let our efforts over Nigeria\nbe a waste and our hopes dashed (Jeremiah 4:3).<br\/>\n\n<\/P>\n\n<h4>Prayers for Nigerian Baptist Bookstore<\/h4>\n<p>\n (1) Lord, move Nigerian Baptist Bookstore from glory to glory in the name of Jesus. <br\/>\n(2) Lord, help Nigerian Baptist Bookstore Board not to take wrong steps and\ndecisions in Jesus\\' name. <br\/>\n(3) Father, make customers to patronise us from the four corners of the world. <br\/>\n(4) Lord Jesus, give the Nigerian Baptist Bookstore staff more wisdom\nstrength, and push to market books in the Bookstrore. <br\/>\n(5) Father, take Nigerian Baptist Bookstore to high level. <br\/>\n(6) Father, remove every covering of darkness from Nigerian Baptist Bookstore. <br\/>\n(7) Lord, give the staff of Nigerian Baptist Bookstore the power to overcome\nevil plans. <br\/>\n(8) Lord, empower and enlarge Nigerian Baptist Bookstore. <br\/>\n(9) Lord, let there be continued unity among the staff of Nigerian Baptist\nBookstore in Jesus\\' name. <br\/>\n(10) Grant Staff of Nigerian Baptist Bookstore journey mercy as they travel this\nyear..\n\n<\/p>"},{"id":3,"title":"march prayer showers","message":"<center>\n\n            <h3> MARCH PRAYER SHOWERS <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> PRAYERS FOR PROGRESS, GROWTH AND GREATNESS <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Father, let the nations of the earth be blessed through me — Zechariah 10:1 <br\/>\n2. Father, I receive heavenly strategies to establish dominion in my life – Isaiah48:17.<br\/>\n3. Lord, help me to grow day by day in obedience to your voice —John 10:4-57<br\/>\n4. O Lord, let my ears hear your direction and let my feet lead me to greenpasture in Jesus\\' name – Isaiah 30:21.<br\/>\n5. Father, order my steps to greatness in Jesus\\' name – Psalm 37:23.<br\/>\n6. Father, uproot the spirit of fear that stops me from moving forward in themighty name of Jesus – Colossians 2:15.<br\/>\n7. Holy Spirit, reveal the areas I need to work on in my life and fill me withwisdom and knowledge in Jesus\\' name – Eph. 1:17.<br\/>\n8. My father, my father, declare a divine change of status in every area of mylife – Genesis 32:28.<br\/>\n9. Lord, I will not let You go unless You bless me – Genesis 32:26.<br\/>\n10. Father, release the power to get wealth and the wisdom of God to createmultiple streams of income -- Deuteronomy 8:18.<br\/>\n11. Every satanic cord that is tying me to a spot is broken in Jesus\\' name. All thebarriers \nthat are preventing me from moving forward are destroyed in Jesus\\'name – Exo. 14:14-15<br\/>\n12. As I come in obedience to God and His Word, I pray that all the days of difficultieshave come to an end in\n my life and I will spend my days in prosperity and my yearsin pleasure in the name of Jesus – Job 36:11.<br\/>\n13. Father, let your glory shine upon my life, my career, my marriage, my family, myacademics, my business, in Jesus\\' name – Isaiah 60:1.<br\/>\n14. I declare that whoever occupies the place God has given me be removed;\n may the Lord unseat them and restore my territory to me in Jesus\\' name Esther 2:1- 4.<br\/>\n15. Lord, make a way for me where there seems to be no way, a hope where there seems to \nbe no hope, possibilities where everything seems impossible in thename of Jesus – Isaiah 43:19.<br\/>\n16. Lord, I commit all my plans into your mighty hands and I have confidenceand trust that you will \nhelp me to establish them in the name of Jesus – Proverbs 16:13.<br\/>\n17. Lord may I be victorious in 2019 in the name of Jesus – Jer. 29:11<br\/>\n18. Father, open the floodgates of Heaven and pour out blessings that are beyond \nmeasures and imagination of this world. Let me have more than enough ofeverythingin Jesus’ name– Mal. 3:10.<br\/>\n19. O Lord, bless my finances with abundance and cause me to prosper in Jesus\\'name – 1 Chron. 4:10.<br\/>\n20. God, give me more influence and opportunities. Take me to new heights. Enlarge my \nterritory and shower me with your blessings – 1 Chron. 4:10<br\/>\n21. I declare now, my cup runs over, thus goodness, mercy, favour, riches, wealth\n and abundance will follow me all the days of my life – Psalm 23:5-6.<br\/>\n22. Lord, anoint me for divine lifting in Jesus\\' name – Psalm 3:3.<br\/>\n23. Every strange hand obstructing my advancement, wither now in Jesus\\' name– Psalm 23:5.<br\/>\n24. O Lord, disgrace every power contending with my lifting in Jesus\\' name –Psalm 3:3.<br\/>\n25. Lord, take me to the highest heights, levels in all areas of my life in Jesus\\'name – Gen. 28:12-13.<br\/>\n26. O Lord, cover my nakedness with your glory in Jesus\\' name – Psalm 1:3.<br\/>\n27. Glory of the living God, arise upon my life and announce my name for greatness in Jesus\\' name – Gen. 12:1-3.<br\/>\n28. Crown of glory, locate my head now in Jesus\\' name— Gen. 39:4.<br\/>\n29. I receive power to operate with sharp spiritual eyes that cannot be deceived\n,in the name of Jesus – Dan. 2:22.<br\/>\n30. You my prayer altar, receive the fresh fire and power of Holy Ghost in Jesus\\'name – Psalm 91:1\n<\/P>\n\n\n<h4>PRAYERS FOR BAPTIST MISSION SCHOOLS <\/h4>\n<P>\n1. Pray for wisdom, knowledge and understanding for principals, staff and students of our mission schools.<br\/>\n2. Pray for financial blessings for parents of Baptist Mission Schools.<br\/>\n3. Pray for journey mercies for the director and staff of Baptist Mission Schools in 2019.<br\/>\n4. Pray for good health and protection for the chairman and board members ofBaptist Mission Schools.<br\/>\n5. Pray for sound health for the president and the entire staff of NBC.<br\/>\n6. Pray against powers and principalities militating against Baptist Mission Schools.<br\/>\n7. Pray for unprecedented success for SS 3 students of our mission schools as they write their exams this year.<br\/>\n8. Pray that the Lord will secure all our mission schools who are operating boarding school system.<br\/>\n9. Pray for sound health for students and staff of our mission schools.<br\/>\n10. Pray that our mission schools will be profitable and be a soul winning centre in Jesus name\n<\/P>"},{"id":4,"title":"april prayer showers","message":"<center>\n\n            <h3>APRIL PRAYER SHOWERS <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> Prayer for the Church <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Lord, let Your Church hold on to the true confession of Your Name and\nAuthority in this age of confusion (Matt. 16: 16 – 18).<br\/>\n2. Lord, may Your Church and the church leaders possess Your revelation, knowledge and\nwisdom needed to direct the affairs of the Church – Eph. 1: 15 – 18.<br\/>\n3. Lord, let our church members grow holistically in your Word to be well\nestablished in your Church – Acts 2: 42.<br\/>\n4. Grant, O Lord, your courage to our church leaders to declare your Word\ncourageously in this crooked age – Acts 4: 23 – 31.<br\/>\n5. May Your Church, O Lord, not grow cold and weary at this time – Colossians 4:2.<br\/>\n6. Lord, open the door of the Word to all our church pastors and leaders in order\nto speak the mystery of Christ – Col. 4: 3 – 4.<br\/>\n7. Lord, anoint our leaders specially to be able to declare your healing virtues\nupon Your Church – James 5:14.<br\/>\n8. Lord, grant unity to our church leaders that their prayers for the Church be not\nhindered – Romans 15:30.<br\/>\n9. Lord, give Your Church the right leaders to enhance her growth – Acts 6: 3 – 4.<br\/>\n10. Lord, release the power of Your Holy Spirit upon Your Church and her\nleaders – Eph. 3: 16 – 19.<br\/>\n11. From now on let our church members take prayer ministry more seriously –\nMatt. 18:20.<br\/>\n12. Lord, please, release the true Spirit of prayer and worship in our church\nprayer meetings - Neh. 8:6.<br\/>\n13. Remove, O Lord, every spirit of distraction at our church prayer meetings –\nPs. 106:48.<br\/>\n14. Grant us, O Lord, the Spirit of obedience in our study of Your Word and\nprayer – Ex. 24:3.<br\/>\n15. Lord, remove every form of idolatry in Your Church – Deut 27: 15 – 26.<br\/>\n16. Lord, bring to an end the day of scarcity of Your Word in Your Church – Jer. 11: 1 – 5.<br\/>\n17. May Your joy, O Lord, fill the heart of every disturbed individual in the\nChurch – Rom. 12: 12.<br\/>\n18. Lord, raise more prayer supporters in our churches for our pastors and\nmissionaries – 2 Cor. 1:11.<br\/>\n19. Lord, let Your peace reign in every crisis-ridden local church – Ps. 122:6.<br\/>\n20. Lord, raise men and women in our churches who love peace and unity –\nIsaiah 62: 6 – 7.<br\/>\n21. Lord, direct the paths of all our young people in the churches in their life-\nchoices – Gen 24: 12 - 15<br\/>\n22. Lord, deliver our fathers in the faith from the spirit of error – Gen. 17:18.<br\/>\n23. Lord, have mercy on us in our Church to heal all manners of sicknesses –\nMatt. 9: 35 – 36.<br\/>\n24. May everyone who worships in our church make it to the New Heaven and\nnew Earth, at last – Isaiah 65: 17 – 18.<br\/>\n25. Lord, give all ministry leaders in our churches grace and wisdom to carry out\ntheir ministries with integrity of heart and skilful hands – Ps. 78: 71.<br\/>\n26. Lord, make us steadfast to the end, despite our current challenges – Ps. 119:33.<br\/>\n27. Lord, release Your grace, courage and wisdom upon our church leaders to\nface powers that be – Esther 4: 16 – 17.<br\/>\n28. Lord, grant genuine repentance to run-away members of our church – Luke\n15: 17 – 18.<br\/>\n29. Lord, cause us to faithfully abide in Your Word – John 15: 1 – 5.<br\/>\n30. Lord, strengthen the fellowship & ministry of our church through committed\nand dedicated members – Acts 2: 43 – 47.<br\/>\n31. Lord, bless our church members spiritually and materially to be a source of\nblessings to our church and ministries – 2 Kings 4: 8 - 13.\n<\/P>\n\n<h4> PRAYERS FOR BAPTIST GUEST HOUSES<\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Father, make our Baptist Guest Houses an abode of Christ and Mission indeed.<br\/>\n2. Father, help us touch lives for You through our services.<br\/>\n3. Father, as people come in and call on your name in our premises, answer\nthem speedily to the glory of your name.<br\/>\n4. Father, help us to model Christ in our style of hospitality.<br\/>\n5. Father, bless and increase everyone working to put smiles on people\\'s faces\nat every Baptist Guest House.<br\/>\n6. Father, let your strong hand of protection be upon our numerous guests.<br\/>\n7. Father, make us solutions to every disturbed heart that passes through us.<br\/>\n8. Father, give us vision and foresight for the future and help us vigorously\nwork to attain our goals.<br\/>\n9. Father, make us a blessing and pride of The Nigerian Baptist Convention.<br\/>\n10. Father, help us all not to miss out on Your great banquet on the last day.\n<\/P>\n"},{"id":5,"title":"may prayer showers","message":"<center>\n\n            <h3> MAY PRAYER SHOWERS <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> Prayers for Children  <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Eternal God, thank you for my children, l pray that they shall be for signs and\nwonders in the land of the living Isaiah 8:18.<br\/>\n2. Heavenly Father, help my children to love you and keep your commandments; show\nthem your mercy and establish your covenant with them Deut. 7:9.<br\/>\n3. Miracle working God, visit the foundation of my children and heal them of every\nform of unfruitfulness in Jesus\\' name 2 Kings 2:20-21.<br\/>\n4. O Lord my God, the death that snatches children away suddenly will not know the\nabode of my children in Jesus\\' name 2 Kings 4:20.<br\/>\n5. O God, let your hands be heavy on whoever is in possession of what belongs to my\nchildren; let them be forced to release them, cause the occupants of their seats of honour to\nbe unseated in Jesus\\' mighty name. Genesis 12:17-19<br\/>\n6. Father, in the name of Jesus Christ, let there be a release of your excellent spirit upon\nmy children, cause them to be recommended before kings and the high places of\nlife. Proverbs 22:29<br\/>\n7. Father Lord, separate my children from bad companies, unfriendly and sinful\nfriends in Jesus\\' name. Proverbs 23:20-21<br\/>\n8. Almighty Father, cause my children to always obtain favour in the sight of anyone\nthat sets eyes on them. Esther 2:16<br\/>\n9. Lord, purify the heart of my children, cleanse their hands from all forms of sins, so\nthat they can receive blessings from you every time, everywhere and wherever they\nmay go daily in Jesus\\' name. Psalms 24:5<br\/>\n10. Implant your fear in the heart of my children, teach them in the way they should choose\nand cause them and their generation to dwell at ease in Jesus\\' name. Psalm 25:12-13<br\/>\n11. O Lord!, I decree that all satanic forces influencing my children to do evil contrary to\ntheir will, loose them and go in Jesus\\' name. Amen. Romans 7:19<br\/>\n12. God of prosperity, breathe upon the handiworks of my children, cause your divine wealth to\nflow into their lives; they will not struggle financially in Jesus\\' name. Genesis 26:12-13<br\/>\n13. O Lord, according to your word in Ephesians 6:12, I come against powers,\nprincipalities, rulers of the darkness of this age, host of wickedness in the heavenly\nplaces strategizing to attack, afflict and destroy the marital bliss of my children in Jesus\\' name. Eph. 6:12<br\/>\n14. Lord, let your Spirit of contentment rest upon my children; keep them free from the\nlove of money. Hebrews 13:5<br\/>\n15. O Lord, by your mighty power, I exclude my children from rape, jail, kidnap, abduction,\ndrugs, from terrorist and all forms of evil occurrences in Jesus\\' name. Psalm 91:10<br\/>\n16. My heavenly Father, destroy any evil power that wants to use my children as a source of\npain or sorrow to me. 2 Samuel 15:14,30<br\/>\n17. Fill my children with uncommon, ageless wisdom, knowledge and discernment and\nmake them ten times better than their contemporaries. Daniel 1:4,20<br\/>\n18. Open the eyes of my children to the tricks of the enemy; let them not be deceived\ninto impurity. 1 John 3:3<br\/>\n19. I come against all forms of conformity in the lives of my children, they will not be\nlights hidden under baskets but blazing infernos that the Lord may be seen through\nthem. Roman 12:1-2, Matthew 5:14&15.<br\/>\n20. Lord, let my children become living testimonies of your glory, their youthfulness\nwill not be a hindrance to their usefulness. 1 Timothy 4:12<br\/>\n21. I speak protection from every snare of the fowler, keep my children safe, O Lord,\naccording to your word in Psalm 91:3,10;no deadly pestilence will overtake them.<br\/>\n22. O God that answers by fire, let your fire consume every strange altar erected and\nevery sacrifice made to debar my children from fulfilling your purposes for their\nlives in Jesus\\' name.1 Kings 18:28.<br\/>\n23. Heavenly Father, baptize my children with the Holy Spirit and fire; cause the fruit and\ngifts of the Holy Spirit to show forth in their lives leading to the expansion of your\nkingdom in Jesus name. Luke 3:16,1 Corinthians 12:8-10, Galatians 5:22<br\/>\n24. O God my Father, let the ground open up and swallow every demonic agent\nmanipulating the lives of my children; put an end to the works of the devil in their\nlives. Numbers 26:10<br\/>\n25. O Lord my Father, turn every evil meant for my children to good in Jesus\\' name. Genesis\n50:20<br\/>\n26. O Lord my God, I decree and declare that another person will not reap the harvest of\nthe labour of my children nor replace them in their days of honour and glory in the\nmighty name of Jesus. Judges 6:3-6.<br\/>\n27. Almighty Father, cause my children never to be forsaken in their hours of need\nneither let their heads be bowed in shame. Psalms 46:1.<br\/>\n28. O Lord, I decree that every failure at the verge of success, walking in circle and hard labour with\nno result ends in the lives of my children today in Jesus\\' name. Deuteronomy 28:3-13.<br\/>\n29. The merciful God, in your mercy connect my children with the fivefold ministry of\ndivine helpers: daily helpers, timely helpers, tireless helpers, compelling helpers and\nunsolicited helpers in Jesus\\' name. 2 Kings 4:1-7.<br\/>\n30. Every satanic hand turning the testimonies of my children to trial, breakthrough to\nbreakdown, prosperity to poverty, miracle to misfortune and peace to pain shall remain paralyzed in Jesus\\' name. 1 Kings 13 4 - 6\n<\/P>\n\n\n<h4> PRAYER POINTS FOR BAPTISO WATER <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Our business will succeed and not fail because Christ dwells richly in us. (Galatians\n2:20)<br\/>\n2. Lord, let our success be a testimony of Your goodness and blessing. Encourage us to\npoint to You that You are our great provider and sustainer.<br\/>\n3. God arise and bless all the works of our hands so that Your name can be glorified with\nBaptiso Water (Deut 28:12)<br\/>\n4. O Lord, deliver us from a mind of procrastination and laziness in the name of Jesus.<br\/>\n5. Lord, give us a spirit of excellence so that we can arise in our calling and glorify your\nname. (Daniel 6:3)<br\/>\n6. Heavenly father we fully commit our plans into Your hands and trust You will help us\nto establish them and expand our market. (Proverbs 16:3)<br\/>\n7. Lord, let Your peace that surpasses all understanding saturate our mind, our body and\nsoul and that of our customers in the name of Jesus Christ.<br\/>\n8. God Almighty, let success manifest in every area of our lives and our customers so\nthat Your name can be glorified.<br\/>\n9. Lord God, we trust You will show us favour wherever we go and wherever we turn in\nthe name of Jesus.<br\/>\n10. We have an assurance and expectation that we will be victorious always in the name\nof Jesus Christ (Jeremiah 29:11).\n<\/P>"},{"id":6,"title":"june prayer showers","message":"<center>\n\n            <h3>JUNE PRAYER SHOWERS <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> Prayers for Students <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. O Lord, help me to have your fear in my heart in the pursuit of my academics, that you\nmay grant me wisdom and understanding. Proverbs 9: 10.<br\/>\n2. O Lord, academic success shall be my portion, as I seek to know and do Your\nWill, in Jesus\\' name. 2 Chronicles 26; 5.<br\/>\n3. Father, in the name of Jesus, help me to be diligent in my academic pursuit. 2\nTimothy 2: 15.<br\/>\n4. O Lord, help me that, irrespective of negative influences on my campus, I shall\nremain focused on You and on my academics. 1 Samuel 18: 14.<br\/>\n5. In the name of Jesus, I receive excellent spirit for all my courses of study, that I\nmay be distinguished among my peers. Daniel 6: 3.<br\/>\n6. O Lord, no matter how difficult my course of study may be, grant me wisdom,\nknowledge and understanding, in Jesus\\' name. Daniel 1: 17.<br\/>\n7. I shall graduate as the best student, academically and morally, in my set, in the\nname of Jesus. Daniel 1: 20.<br\/>\n8. O Lord, grant me scientific insight, that I may, through research, proffer solution to a\nteething problem in my generation, in the name of Jesus. Daniel 5: 14.<br\/>\n9. Lord, I commit my course of study to You, let my academic plans succeed, in\nJesus\\' name. Proverbs 16: 3.<br\/>\n10. O Lord, I commit my spiritual and physical strength to You, that, as I run\naround for my academics, I shall not faint. Isaiah 40: 31.<br\/>\n11. O Lord, help me not to worry much about material things, so as to be focused on\nmy academic pursuit. Matthew 5: 33 - 34.<br\/>\n12. O Lord, You are the only source of help in my academic pursuit. I shall not be\ndisappointed, in the name of Jesus. Psalm 121: 2.<br\/>\n13. O God, at turbulent times in my academic journey, uphold me with Your\ngracious hands, in the name of Jesus. Romans 8: 31.<br\/>\n14. I come against every form of physical, spiritual and academic disaster in my\nlife, in the name of Jesus. Proverbs 3: 25 - 26.<br\/>\n15. O God, my physical disabilities shall not rob me of my academic potentials, in\nthe name of Jesus. 1 Corinthians 1: 26 – 29.<br\/>\n16. Lord, I shall not boast because of my academic attainment. I shall always\nhumble myself, that You may lift me higher in my educational pursuit, in Jesus\\'\nname. 1 kings 19: 1 – 3.<br\/>\n17. Lord, direct my heart, that I may not make costly academic mistakes, in Jesus\\'\nname. 2 Thessalonians 3: 5.<br\/>\n18. Lord Jesus, all powers belong to You. Nullify all causes of failure in my life, in\nthe name of Jesus. Numbers 23: 23.<br\/>\n19. Every spiritual yoke, barrier and limitation to success in my life, I command you to\nbreak into pieces, in the name of Jesus. Isaiah 10: 27.<br\/>\n20. Every inherited and self-made attitude that has made me register in the school\nof failure in my academic pursuit, I command you to receive Holy Ghost fire, in\nthe name of Jesus. 1 Chronicles 4: 9-10.<br\/>\n21. I receive an excellent spirit after the order of Bezalel and Daniel, in the name of\nJesus. Exodus 35: 35, Daniel 6: 33.<br\/>\n22. My father, my father, lay your hand of fire upon me; and give me sound mind, that I may\nexcel ten times better than my colleagues, in the name of Jesus. Daniel 1: 17 & 20.<br\/>\n23. I reject the spirit of forgetfulness, confusion, error and satanic manipulation of my\nacademic destiny, in the name of Jesus. 1 John 2: 27.<br\/>\n24. In academic excellence, I shall always be the head and not the tail, in the name\nof Jesus. Deuteronomy 28: 12 – 13.<br\/>\n25. Lord Jesus, send your Spirit to encamp around me day and night; and anoint me for\nsuccess, that there shall be no failure in my examinations. Acts 2: 4 & 4: 13.<br\/>\n26. Any area of my life that I have lost to failure, I receive restoration; and every\nseed of failure planted in me by the enemy, be consumed by fire, in the name of\nJesus. Joel 2: 25 & Hebrews 12: 29.<br\/>\n27 Lord, through academic excellence, announce me to the end of the world, in the\nname of Jesus. Psalm 119: 98- 100.<br\/>\n28. O Lord, through my academic excellence, grant me maturity of mind above my\nmates in the name of Jesus. Proverbs 17: 27.<br\/>\n29. My father and my Lord, through academic excellence may I be preferred above my\ncolleagues in all spheres of life, in the name of Jesus. Daniel 6: 3.<br\/>\n30. O God, from your majestic glory, speak words that shall impart in me,\nacademic excellence, in the name of Jesus. Amen. 2 Peter 1: 17.\n<\/P>\n\n<h4> PRAYERS FOR BOWEN UNIVERSITY, IWO <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Thank God for the vision and efforts of the founding fathers of our prestigious\nBowen University.<br\/>\n2. Appreciate God for all who have held one leadership position or the other that has\n shaped and influenced the steady advancement of Bowen University through the years.<br\/>\n 3. Pray for divine uplifting and direction for the current leaders of Bowen University to\ncontinually pursue the will and purpose of God for the University.<br\/>\n4. Pray that God will lead the University to realize the salvation of both staff and\nstudents and the restoration of all that the cankerworm, caterpillars, locust and\npalmerworm have eaten in the years past.<br\/>\n5. Pray that God will raise financial helpers for Bowen University to meet all her\nfinancial needs, and that Bowen will attract research grants from all over the\nworld from donor agencies.<br\/>\n6. Ask for journey mercies at all times for the Vice Chancellor, Principal Officers,\nStaff and Students of Bowen University.<br\/>\n7. Pray that both Staff and Students of Bowen University will be exemplary in\ncharacter and learning through which they will impact themselves and the world.<br\/>\n8. Pray for financial provisions for all parents and guardians of our students so that they\nwill be able to sustain their children and wards in Bowen University.<br\/>\n9. Pray that God will keep Bowen University Students away from evil vices that\nhave besieged other higher institutions. Pray that a passion to hate such vices will\nbe raised by the Holy Spirit among our Staff and Students.<br\/>\n10. Pray for all spiritual leaders in position of authority in Bowen to fulfil God\\'s divine\nagenda and purpose. Ask for astute focus on Godliness, Excellence and Leadership\nas they guide, lead and direct the affairs of the University.\n<\/P>"},{"id":7,"title":"july prayer showers","message":"<center>\n\n            <h3> JULY PRAYER SHOWERS <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> Prayers for Business\/Career  <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. I receive favour and multiplication for my business\/career in spite of\nprevailing drought in the name of Jesus (Genesis 26:12).<br\/>\n2. The economy of this nation will flourish and rest from every attack from\nthe pit of hell in Jesus\\' name (Genesis 26:22).<br\/>\n3. Lord, lack of progress and retrogression are not Your Will for me. I reject\nlack and stagnation in my life in the name of Jesus (Exodus 14:15).<br\/>\n4. Because the grace for inventions comes from you, Lord, I receive grace to\nbe a contributor and not a consumer in Jesus\\' name (Exodus 35:30-12).<br\/>\n5. Lord, render powerless all enchantment against me, my family, my\nbusiness and my career (Number 23:23).<br\/>\n6. I pray that the Lord will expand my territory and make it greater than it\nwas in the past in Jesus\\' name (1 Chronicles 4:9-10).<br\/>\n7. My God, by the power of your Spirit, I overcome the enemies of my\ncareer (Nehemiah 6:16).<br\/>\n8. Like Daniel, your servant, lift me up and let me experience favour and\ndistinguishing promotion in my business (Daniel 2: 46-49).<br\/>\n9. Lord, I shall prosper in my entire endeavour in Jesus\\' name (Job 22: 28).<br\/>\n10. When others are complaining for lack and want, I shall enjoy abundant\nsupply from you in Jesus\\' name (Psalm 34:10).<br\/>\n11. I receive wisdom and directive for success today and other days of my\nlife in Jesus\\' name (Psalm 37:5).<br\/>\n12. God of all provisions, meet the needs of all retirees who have served\nNigeria faithfully in the name of Jesus (Psalm 37: 25).<br\/>\n13. The grace to fulfil destiny comes from You my God. Your purpose for\nmy life shall be established in Jesus\\' name (Psalm 75:6).<br\/>\n14. God of all goodness, I receive grace to see Your good hand in my entire\nendeavours in Jesus\\' name (Psalm 77:13).<br\/>\n15. My Lord and Saviour, break every obstacle on my way to success to in\nJesus\\' name (Isaiah 45: 2).<br\/>\n16. My Father and God, grant unto me the strength that I need to come out\nvictorious in my chosen career (Isaiah 41: 10).<br\/>\n17. Lord, I call unto you now, visit my business \/ career with unusual favour,\nenlargement and promotion in Jesus\\' name (Jeremiah 33:3).<br\/>\n18. O Lord, I speak life into dead works of my hands; let them receive\nrestoration (Ezekiel 37:9-10).<br\/>\n19. Lord Jesus, arise and reclaim all my entitlements which have been\nwithheld from me in the name of Jesus (Obadiah 1:17).<br\/>\n20. Wealth and riches come from You, Lord I claim enough resources to\ncarry out my undertakings in Jesus\\' name (Haggai 2:8).<br\/>\n21. God, the creator of heaven and earth, in the name of Jesus, I claim fullness\nof life which will result to true prosperity for Nigeria (John 10:10).<br\/>\n22. God of all glory, in the name of Jesus, deliver Nigeria from the demon of naira-\nmania which has enslaved kings, lords, priests and many citizens of this land\n(Acts 16:16-19).<br\/>\n23. Lord Jesus, even if the economy of this country is not favourable, I shall\nnever lack any good thing (Philippians 4:19).<br\/>\n24. I will not labour in vain in the name of Jesus (1 Corinthians 15: 58).<br\/>\n25. You provide seeds for the sower and food for Your people; open the door\nof employment for all applicants in Nigeria in Jesus\\' name (2\nCorinthians 9: 10).<br\/>\n26. You are God who finishes whatever You begin; complete all your good\nworks in my enterprises in Jesus\\' name (Philippians 1:6).<br\/>\n27. All handwritten covenants against my prosperity are nailed to the cross\nby faith today in Jesus\\' name (Colossians 2:14-15).<br\/>\n28. Lord Jesus, every closed doors against success in my career and business\npursuit, in line with Your Word, I declare them opened (Rev. 3: 8).<br\/>\n29. God, the owner of all things, I receive the empowerment to be a faithful\ngiver to Your ministry in Jesus\\' name (Proverbs 11:254).\n<\/P>\n\n<h4> PRAYERS FOR BAPTIST PRESS NIGERIA LIMITED  <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Pray for an open door in all areas of life for the Board, Management &\nstaff of Baptist Press.<\/br>\n2. Pray for the General Manager, Rev. Olajide Aderinto for divine wisdom\nand understanding to steer the ship of the Press to greater heights.<\/br>\n3. Pray for the Production Manager and the Financial Manager for grace and\nleadership spirit to lead their team and the press to reach the pinnacle of\nsuccess.<\/br>\n4. Pray for Baptist Press staff for divine protection over them and their\nfamily.<\/br>\n5. Pray for breakthrough in all we lay our hands on in Baptist Press\nespecially during the time of the printing of NBC annuals, convention\nmaterials and other jobs for error free productions.<\/br>\n6. Pray for our marketing department, for divine favour wherever they go\nto source for jobs.<\/br>\n7. Pray for our drivers for divine protection and that God will grant them\njourney mercies whenever they embark on any journey.<\/br>\n8. Pray for enlargement for the Press, both locally and internationally.\n9. Pray for the entire staff for God\\'s mercy and favour.<\/br>\n10. Pray that we will not encounter any strange incident, be it fire outbreak,\ntheft or accidents on the machine in Jesus\\' name.<\/br>\n11. Commit all the Board of Directors of the Press to God\\'s hand beginning from the\nchairman, Dn. Tunji Olugbodi and other Directors that God will grant them the\ncourage, wisdom and will power to lead the press to an enviable height in Jesus\\' name.<\/br>\n12. Pray that God will bless and increase all the customers of the press both\nin the NBC family and outside in Jesus\\' name.\n<\/P>"},{"id":8,"title":"august prayer showers","message":"<center>\n\n            <h3>AUGUST PRAYER SHOWERS <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> Prayers for Husband and Wife <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Father, I am grateful for my union with my spouse; thank You for making us\nhelpers to one another. May our love continue to grow for each other in Jesus\\'\nname. Genesis 2:18.<\/br>\n2. Our togetherness will be till eternity by your might power in Jesus\\' name. Any\npower that may want to tamper with our unity as husband and wife is consumed\nby the power in the name of Jesus Christ. Genesis 2:24.<\/br>\n3. We rebuke every deceit of the evil one in our relationship and union in Jesus\\'\nname. Genesis 3:1.<\/br>\n4. We rebuke every force that will make us hide from God; we receive grace to be\nobedient and enjoy God\\'s fellowship till eternity in Jesus\\' name. Genesis 3:8.<\/br>\n5. As husband and wife, we enter into covenant of peace, joy, abundant grace and\nunending favour of God. Genesis 17:9.<\/br>\n6. My husband will not relent in his priestly duty in our home. I pray for outpour of\nGod\\'s grace and power to love God and lead the family in the way of the Lord in\nJesus\\' name. Genesis 18:19.<\/br>\n7. As a wife, I receive grace to fear God and live in that consciousness in all that I do\nin Jesus\\' name. Exodus 1:17.<\/br>\n8. I prophesy that our lives will enjoy God\\'s divine favour as husband and wife. We\nshall remain God\\'s treasured possession. Exodus 19:5.<\/br>\n9. We receive grace for abundance and surplus in all our endeavours in Jesus\\' name.\nDeuteronomy 11:14.<\/br>\n10. We receive the wisdom of God to live our lives in service to God and others.\n1 Samuel 25:23.<\/br>\n11. I rebuke every commotion that the enemy may want to raise between me and my\nspouse and reject every action leading to curse in the mighty name of Jesus\nChrist. 2 Samuel 12: 10.<\/br>\n12. Every siege of lack and famine is lifted and we enter into our surplus and\nabundance in the name of Jesus Christ. 2 Kings 7: 8.<\/br>\n13. Our help will always come from the Lord all the days of our lives. Psalm 121:1-2.<\/br>\n14. We bind every effort to scatter our union in the name of Jesus Christ. Every strongman\nstationed against me and my spouse is judged in Jesus\\' name. Matthew 12: 29.<\/br>\n15. Every force and power against our progress and lifting is subdued in the mighty\nname of Jesus Christ. Matthew 11:28-29.<\/br>\n16. Lord, rescue us from the dominion of darkness and grant us complete redemption\nin the name of Jesus Christ. Colossians 1: 13-14.<\/br>\n17. We receive grace to follow, walk and work for you all the days of our lives. Luke 9:23, 62.<\/br>\n18. We receive grace to live by the biblical standard in loving, cherishing and caring\nfor each other. Colossians 3: 18-19.<\/br>\n19. We receive divine grace, provision, and wisdom to care and bring up our children\nin the way of the Lord in order to constitute peace, joy and channel of blessings to\nour family and the entire world. Proverbs 22:6.<\/br>\n20. O Lord, we as husband and wife pray that all our biological and spiritual children\nbe like Jesus Christ growing in wisdom, statures, and in favour with God and\npeople. Luke 2:52.<\/br>\n21. My spouse and I receive divine anointing to be godly models to our spiritual and\nbiological children in the name of Jesus. Matthew 18:3-6.<\/br>\n22. Our God, we pray that the Holy Spirit will convince all our spiritual and biological children\nto put faith in You through Jesus Christ and remain committed to You. Acts 16:31.<\/br>\n23. My spouse and I ask that you uphold us that we may remain righteous and rich in\nyou until our old age and be able to leave good inheritance for our children and\ngrandchildren in Jesus Christ\\'s name. Proverbs 13:22.<\/br>\n24. We receive the power of God to stand firm in the Lord and never to deviate from\nfollowing the Lord. 2 Thessalonians 2: 15.<\/br>\n25. As husband and wife, we receive gracefor contentment in this world full of\ngreed and covetousness. I Timothy 6: 6-7.<\/br>\n26. My spouse and I shall be models unto others by our lifestyles and relationships\nwith others in the name of Jesus Christ. Amen. Titus 2: 2-3.<\/br>\n27. My spouse and I will not destroy our homes with our mouts by evil and negative\nutterances in the name of Jesus Christ. Rather, we shall praise God and bless\nourselves and others always. James 3:10.<\/br>\n28. I receive divine health for myself and my spouse because this is your desire and\npurpose for us. 3 John 2.<\/br>\n29. My spouse and I will not fall from faith; our lives shall be preserved without fault\nbut with great joy in God\\'s glorious presence. Jude 24.<\/br>\n30. We eagerly await your return and we are expectant of the great reward for the faithful;\nuphold us Lord to the end of the journey in Jesus\\' name. Amen. Revelation 22: 12-16.\n<\/P>\n\n<h4> PRAYERS FOR NEW FRONTIERS TELEVISION <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Give thanks to God for where New Frontiers Television started, where she is\ntoday and where God is taking her. Thank GOD for the sustenance of the vision.\nHe has not allowed the counsel of wicked to come to pass over the\nestablishment.<\/br>\n2. Commit the television station into God\\'s hand; tell Him that the vision must not\ndie...He should frustrate and disappoint the crafty of the wicked over the\nstation. Job 5:12<\/br>\n3. Pray that God will grant grace to the station not to compromise on the purpose\nfor her establishment i.e. winning souls for Christ. Pray that through the\nbroadcast souls shall be saved, life shall be blessed and yokes shall be broken.<\/br>\n4. Ask for the spirit of wisdom, divine direction for the members of staff. Wisdom\nto excel in all aspect; divine direction so that they will not deviate from the\noriginal plan of God for the establishment. Ask God to expand the station and\nenlarge her coast.<\/br>\n5. Pray to God for divine protection for the staff that as they will be travelling from\none state to another for kingdom expansion, they will not meet death. God will\nmake the roads accidents and calamity free. Ask for protection against any form\nof mishap. There shall be no loss of lives, equipment and no fire outbreak.<\/br>\n6. Pray that God to rise and deliver this station from every satanic influence and\npower of the darkness waging war against her.<\/br>\n7. Pray for the station for God\\'s help to generate more revenue for the expansion of\nHis kingdom.<\/br>\n8. Pray for wisdom, guidance and direction for the management team of the station.<\/br>\n9. Pray that God will send customers from all over the globe to patronise the\nstation.<\/br>\n10. Pray that the station will be a household name within and outside the country.\n<\/P>"},{"id":9,"title":"september prayer showers","message":"<center>\n\n            <h3> SEPTEMBER PRAYER SHOWERS <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> Praying Through Acts of the Apostles  <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Father, release Your promise to your Church as of old; baptize every\nmember with the Holy Spirit (Acts 1:4-5).<\/br>\n2. Jesus, empower Your church today to witness aggressively for You\n(Acts 1:8).<\/br>\n3. Lord Jesus, cause Your church to keep looking intently for Your second\ncoming (Acts 1:10-11).<\/br>\n4. Lord Jesus, rid Your church of greed (Acts 1:18).<\/br>\n5. Father, help every church member to overcome whatever will deny him\nor her from enjoying Your grace (Acts 1:20).<\/br>\n6. Lord, You know the heart of every man, choose leaders after Your own\nheart to lead Your church (Acts 1:24).<\/br>\n7. Lord Jesus, let there be prayer revival in your church today (Acts 1:14).<\/br>\n8. Come, Holy Spirit as in the day of Pentecost; fill every member with\nYour power (Acts 2:1-4).<\/br>\n9. Holy Spirit, empower the church to communicate the gospel in the\nlanguage that people understand (Acts 2:5-6).<\/br>\n10. Lord Jesus, unite Your church as of old (Acts 2:1).<\/br>\n11. Father, help Your church to present the gospel in ways that will convict\nsinners of their sins and bring them to repentance (Acts 2:37).<\/br>\n12. Gracious Lord, let the proclamation of Your word always lead to the\ngrowth of Your church (Acts. 2:41).<\/br>\n13. Father, cause your church to be devoted to the apostolic teaching,\nfellowship, Holy Communion and prayer (Acts 2:42).<\/br>\n14. Lord Jesus, let every church be filled with awe as of old. Let signs and\nwonders be performed in your church as of old Acts 2:43.<\/br>\n15. O God of grace, let there be believers\\' unity, sharing and caring as of old\n(Acts 2:44-46).<\/br>\n16. Lord Almighty, let only the saved be added to Your church. Rid Your\nchurch of multitudes of unsaved membership (Acts 2:47).<\/br>\n17. Lord Jesus, empower Your servants as of old to perform wonders in\nYour name (Acts 3:6-9).<\/br>\n18. Lord Jesus, let everyone who hears the gospel message believe and be\nadded to Your church (Acts 4:4).<\/br>\n19. Father, confound the enemies of the church and render them speechless\nand powerless (Acts 4:16-18).<\/br>\n20. Lord, the boldness and courage to answer the persecutors of the church\nappropriately, give to Your church (Acts 4:19-20).<\/br>\n21. Lord, deliver Y our church from her persecutors (Acts 4:21).<\/br>\n22. Lord Jesus, consider the threat to the gospel and the lives of believers today,\nenable believers to speak Your Word with great boldness (Acts 4:29).<\/br>\n23. Lord, stretch out your hand to heal and perform signs and wonders\nthrough the name of Jesus as of old (Acts 4:30).<\/br>\n24. Lord, let there be love shared among believers; let Your church be one\nin heart and mind (Acts 4:32).<\/br>\n25. Gracious Lord, let church leaders testify with great power; let Your\ngrace be powerfully at work in them (Acts 4:23).<\/br>\n26. Father, pour a generous Spirit in Your church to meet one another\\'s\nneeds (Acts 4:34).<\/br>\n27. Father, cleanse Your church of dirt and cause great fear that will make\nevery worshipper abstain from sin and evil (Acts 5:11).<\/br>\n28. Lord, create circumstances and events that will make Your church\nhighly regarded by people now and always (Acts 5:13).<\/br>\n29. Lord Jesus, make Your church the centre of healing and deliverance for\nall persons (Acts. 5:16).<\/br>\n30. Father, whatever happens, help Your church to never stop teaching and\nproclaiming the good news that Jesus is the Messiah (Acts 5:42).\n<\/P>\n\n<h4> PRAYERS FOR THEOLOGICAL INSTITUTIONS  <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Pray for God’s sustaining grace and provisions on behalf of the\ninstitutions as well as faithfulness and commitment on their part to God.<\/br>\n2. Pray for peace, love, unity and harmony as well as fruitfulness among\nthe institutions’ families, academic and non-academic staff.<\/br>\n3. Pray for spiritual and physical security for the institutions.<\/br>\n4. Pray for God’s guidance and enablement on the institutions’ leadership.<\/br>\n5. Pray for the blessing and care of the Board Members and their families.<\/br>\n6. Pray for provision, academic success, and wellbeing of the students.<\/br>\n7. Pray for more grace, material and financial blessings of the sponsors of\nthe students and their families.<\/br>\n8. Pray for security, peace and development of the societies wherein the\ninstitutions are located and the nation at large.<\/br>\n9. Pray for their sponsoring Conferences, Churches, Associations and the\nConvention; individuals and other donors.<\/br>\n10. Pray for healing and strength for those who may be sick and weak\namong them as well as for understanding and cooperation between\nstudents and staff.\n<\/P>"},{"id":10,"title":"october prayer showers","message":"<center>\n\n            <h3> OCTOBER PRAYER SHOWERS <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> Prayers on Healing and Health  <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Lord, I repent of all sins that bring Y our wrath upon my health. Lord,\nforgive my transgressions and restore soundness in my bones. (Psalm\n38:3)<\/br>\n2. Heavenly Father, forgive me for every time I have denied my body of\ngood food, rest and habits that secure good health. (Zeph. 1:17)<\/br>\n3. Lord, grant me the wisdom and peculiar information to observe daily\nphysical habits and spiritual routines that will secure health and healing in\nJesus\\' name. (Psalm 107:17)<\/br>\n4. Holy Spirit, lead me into necessary restitutions and confessions relevant to\nmy absolute healing and deliverance in Jesus\\' name.(James 5:16)<\/br>\n5. I exercise my full authority over every form of illness, diseases and impure\nspirits troubling me \/ anyone around me in Jesus\\' name. (Matt 10:1)<\/br>\n6. In the name of Jesus, I receive total healing to enjoy all-round health,\nabundant peace and security in line with Jeremiah 33:6<\/br>\n7. Lord, stretch forth Your hand to heal all forms of emotional, mental and\nphysical illness in me in the name of Jesus Christ (Acts 4:30).<\/br>\n8. In the name of Jesus, I minister divine healing upon my body, spirit and soul.\nLet every broken tissue receive immediate recovery in line with Isaiah 53:5.<\/br>\n9. I earnestly invite the power of the Lord to perfect my healing in Jesus\\'\nname. (Luke 5:17)<\/br>\n10. By the power in the blood of Jesus, I nullify every pain and suffering\nrooted in my body in the name of Jesus. (Isaiah 53:4)<\/br>\n11. By the power of His resurrection, I hide my health and wellbeing in the\nhand of the Elohim and I declare I am healed, I will not die in Jesus\\'\nname. (Duet 32:39)<\/br>\n12. Lord, heal me and restore every lost virtue and eroded resources in Jesus\\'\nname. (2 Chron 7:14)<\/br>\n13. As from today, let every manmade-report on my health lose its validity in\nJesus\\' name; from now on, the authority of Psalm 107:20 gains expression\nover my health in Jesus\\' name.<\/br>\n14. I belong to Jesus, therefore every form of hereditary disease is removed\nfrom my life in Jesus\\' name. (Exodus 23:25)<\/br>\n15. May the Lord honour His word in Exodus 23:26, crushing every delay in\nchildbirth or related illnesses in Jesus\\' name.<\/br>\n16. I terminate every record of premature death in my lineage in Jesus\\'\nmighty name, Exodus 23:6b<\/br>\n17. By faith in the completed work of Calvary, as I lay hands on any sick part of\nmy body, I become healed in Jesus\\' name. From now on, \\'these signs shall\nfollow me\\' in Jesus\\' name (Mark 16:18).<\/br>\n18. Lord, grant me exemption from every communicable disease at school, work\nor in the neighbourhood. Honour Exodus 15:26 in my family this year in\nJesus\\' name.<\/br>\n19.(Mention the name) you are loosed from every\noppression of the devil in Jesus\\' name. I command every grip of the\nspirit of infirmities sponsoring illness to break now in Jesus\\' name.\n(Luke 13:10-16)<\/br>\n20.(With great faith for instant healing shout out the name)\nJesus Christ makes you whole. I decree an immediate end to every pending\nparalysis in Jesus\\' name. (Acts 9:34)<\/br>\n21. I terminate every demonic operation responsible for wrong\/ inconclusive\ndiagnosis in Jesus\\' name. Right away, I order the eternal arrest of every\nsatanic agent of illness in my system in Jesus\\' name. (Luke 9:42)<\/br>\n22. In the name of Jesus, I annul every engagement with the spirit of death in\nJesus\\' name.<\/br>\n23. Dear Lord, transfuse my blood with the blood of Jesus. Let the blood of\nthe lamb cleanse and purify me of every uncleanness and sicknesses in\nJesus\\' name. (Lev 17:14a)<\/br>\n24. Thank you Lord for the full restoration of my health, from the crown of\nmy head to the sole of my feet, I receive total restoration of divine\nhealth in Jesus\\' name (Isaiah 38:16)<\/br>\n25. Heavenly Lord, thank you for healing me, as I rejoice in the scriptures\nPsalms 30:2 may this remain my permanent testimony:“that I called upon\nyou and you healed me”.(Isaiah38:19)\n<\/P>\n\n<h4>PRAYERS ON CHRISTIAN ASSOCIATION OF NIGERIA (CAN)\nPsalm 2: 1-12; Psalm 122:1-9; Psalm 11: 1-3; Numbers 23:23; Matthew 16:18.<\/h4>\n\n<p>\n1. Thank God for the Church of God in Nigeria.<\/br>\n2. Let God make the Church in Nigeria a citadel of holiness, wonders,\nmiracle glory marked out by purity, power and progress.<\/br>\n3. Let the rage of darkness against the Church be quenched in Jesus\\'\nName. (Psalm 2:1).<\/br>\n4. The gates of disunity shall not prevail against the Church in Jesus\\' Name.\n(Matthew 16:18).<\/br>\n5. Pray for the National leadership of CAN: President, Executive\nMembers, Directors, Chairman of North and South etc. that God will\nlead them in all their endeavours.<\/br>\n6. Pray for all the state chapters of CAN and their leadership that God\nwill use them for HIS glory at all times.<\/br>\n7. Pray for all the Blocs in CAN and their leaders: CCN; CSN;\nPFN\/CPFN; OAIC; ECWA\/TEKAN. Pray that God will use them to\nmanifest His glory in Nigeria.<\/br>\n8. Pray for all CAN chapters at the local Government levels and their\nleaders. Pray that they will not disappoint nor fail God.<\/br>\n9. Pray that as CAN interface with other religious bodies in NIREC, she\nwill not compromise or sell her birthright.<\/br>\n10. Let the satanic divination and enchantments against the Church come\nto nothing. (Numbers 23:23).<\/br>\n11. Bind the spirit behind satanic wisdom and intelligence against the\nChurch.<\/br>\n12. The glory of God shall not be taken away from the Church.<\/br>\n13. Pray against every battle from the bottom of the pit to injure the\nChurch.<\/br>\n14. Every force of Goliath boasting against the Church shall not prosper.<\/br>\n15. Break every demonic covenant between the Church and evil powers in the name of\nJesus.<\/br>\n16. Let God arise and go forth as a mighty man of war, cry, roar and prevail\nover the enemies, the Strongman, unclean spirits and evil agents fighting\nthe Church.<\/br>\n17. Pray that the counsel of evil kings against the Church be scattered.<\/br>\n18. Pray that God will arise, rend the heavens, come down in His fury and\nuproot every satanic altar that is speaking against the Church.<\/br>\n19. Pray that the imagination of the wicked against CAN be neutralised.<\/br>\n20. Pray that the peace of God will reign in CAN.<\/br>\n21. Bring down the god of mammon in CAN.<\/br>\n22. Pray against sponsorship of satanic disunity, disaffection, allegations and\naccusations in CAN.<\/br>\n23. Pray that unity will reign, the light of God will shine and the glory of God\nwill shine in CAN.<\/br>\n24. Let the enemies of CAN be put to shame, disgrace and disrepute.<\/br>\n25. Oh God, expose and disgrace every secret perpetrators of the crisis in CAN.<\/br>\n26. Let humility reign among CAN Leadership. Matthew 5:6.<\/br>\n27. Holy Spirit reveal deep and secret things about the problems in CAN\nLeadership and please proffer solutions in Jesus Name.<\/br>\n28. Let confusion reign among the enemies of CAN.\n<\/p>"},{"id":11,"title":"prayer showers for november","message":"<center>\n\n            <h3>PRAYER SHOWERS FOR NOVEMBER <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> I AM THE BREAD OF LIFE (JOHN 6:35) <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. I will not be hungry in this life (Ps. 23:1-2)<\/br>\n2. My table will not lack bread (Ex. 16:4-5)<\/br>\n3. I will not gather for another to eat (Judges 6:3-6)<\/br>\n4. O God, I receive the grace to live on the bread of life always (Deut. 8:9)<\/br>\n5. God, I receive strength for this Year to go beyond my expectations and\ndesires (2 Kings 19:17-18)<\/br>\n6. I declare my daily needs are met in Christ Jesus (Ex. 16:15)<\/br>\n7. I shall not experience spiritual and physical famine (Amos 8:11-12)\n<\/P>\n\n<h4> I AM THE LIGHT OF THE WORLD (JOHN 9:5) <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Every curse of confusion and darkness be broken in Jesus\\' Name (1\nSam. 3:1-2)<\/br>\n2. You agent of darkness in my life, family, office, and home, lose your\ngrip on me (John 10:10)<\/br>\n3. Every curse of stagnancy, I terminate you in my life and endeavors\n(Gen. 1:2-4)<\/br>\n4. Wherever ignorance has held me captive, deliver me O Lord (Rom.\n1:20-21,1 Cor. 1:18-25)<\/br>\n5. I declare that my darkness is turned to light (Ps. 27:1)\n    <ul>\n        <li> My trial to testimony <\/li>\n        <li> My failure to success 2 Sam. 22:29<\/li>\n        <li> My worry to story<\/li>\n        <li> My shame to fame<\/li>\n    <\/ul><\/br>\n6. I shall not stumble nor fall as the year draws to a close. (Exodus.13: 21)<\/br>\n7. The light of God shall illuminate my path, plans and make me fruitful\n(Job 12:22)\n<\/P>\n\n\n<h4> I AM THE DOOR (JOHN 10:9)  <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Lord, I will not be restricted where I am supposed to make progress\n(Ezekiel. 5:8)<\/br>\n2. Every curse of closed opportunity be broken in all areas of my life\n(Rev. 3:8)<\/br>\n3. Every knock on my door shall be for lifting and testimony (Matt. 7:7)<\/br>\n4. No evil shall gain entrance into my life in Jesus\\' Name (Ps. 91:1-2)<\/br>\n5. Declare open door for yourself. (Rev. 3:8)<\/br>\n6. Doors shall open of its own accord for my favour, deliverance, and\nlifting (Act 12:10)<\/br>\n7. I close all doors against poverty, sickness, bareness, spiritual\nlukewarmness and failure.\n<\/P>"},{"id":12,"title":"prayer showers for december","message":"<center>\n\n            <h3>PRAYER SHOWERS FOR DECEMBER <\/h3> <!--MONTH NAME e.g JANUARY PRAYER SHOWERS -->\n            \n<\/center>\n<h4> I AM THE GOOD SHEPHERD (JOHN 10:11, 14) <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. God help me to obey you, hear you well and follow your leading. (2 Tim.\n2:19; Ps. 91:14-16)<\/br>\n2. Every curse of not getting direction be broken in Jesus\\' Name (Prov. 20:24)<\/br>\n3. Wolves of this world will not devour me (John 10:14)<\/br>\n4. Getting to my green pasture will not be difficult for me (Ps. 23)<\/br>\n5. Voice of strange shepherd I silence you in Jesus\\' Name (John 10:1-5; Ps 29)<\/br>\n6. My ears shall not be closed to my Shepherd\\'s voice (2 Tim. 2:19)<\/br>\n7. I receive direction, instruction for the journey of 2020.\n<\/P>\n\n<h4> I AM THE RESURRECTION AND LIFE (JOHN 11:25) <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. I break every covenant with the grave (Isa. 28:18)<\/br>\n2. My life is renewed and my old age sustained by God (Ruth 4:15)<\/br>\n3. Every curse of spiritual death be broken (Gal. 2:19-21)<\/br>\n4. There shall be no loss of life in my home (Ps. 18:1-2)<\/br>\n5. Declare life into your business, marriage, ministry and children\n    <ul>\n    <li>My dream shall not die<\/li>\n    <li>My ministry shall not die Ezekiel 37:4-6<\/li>\n    <li>My career shall not die<\/li>\n    <li>My home shall not break<\/li>\n    <\/ul><\/br>\n6. I terminate every grave experience. (Act 2:27)<\/br>\n7. Those who seek my life, be put to shame and confusion. (Psalm 70:2)\n<\/P>\n\n<h4> I AM THE WAY THE TRUTH AND THE LIFE (JOHN 11:25)  <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Every curse of not knowing what to do be broken.<\/br>\n2. I refuse to live lesser than the grace of God upon my life in Jesus\\' Name.<\/br>\n3. I receive revelation for the journey of 2020 because Jesus is the Way (Jer. 10:23).<\/br>\n4. I receive grace not to doubt God (Luke. 1:45).<\/br>\n5. To walk in your way, know the truth and live in abundant life will not be\ndifficult for me this month (Deut. 5:32-33).<\/br>\n6. My life will not be a waste the remaining part of this year. (Isaiah 41:14-16)<\/br>\n7. Every vagabond spirit is banished in my life. (Gen. 4:10-12)\n<\/P>\n\n<h4> I AM THE TRUE VINE (JOHN 15:1-5)  <\/h4>  <!--PRAYER SUBTITLE -->\n<P>\n1. Every curse upon my economic activity be broken (1 Kings 17:1-16).<\/br>\n2. God, I will not be detached from you (Ps. 1:1-3).<\/br>\n3. I will flourish like the palm tree (Ps. 92:12, Ps 14:11).<\/br>\n4. I command increase and fruitfulness upon the works of my hand (Gen. 35:11, Ps. 128:3).<\/br>\n5. My labour shall not be in vain. (Isa. 65:21-22)<\/br>\n6. Every covenant of reduction is broken in my life. (Judges 6:4)<\/br>\n7. None of my seeds will be a waste in Jesus\\' Name. (Matt.13:1-9, Isa. 55:12-13)<\/br>\n8. Every power working against me not to succeed be destroyed in Jesus\\'\nName. (Gen. 1:4, 31) <\/br>\n9. Every curse of sorrow be broken. (Mark 5:1-15) \n<\/P>"}]